ha1vk/TMS320F28-USBDMSC-GeekCon-2024/usblib/device/usbdmsc.c
    ASSERT(pvMSCDevice != 0);

    //
    // Determine if the serial device is in single or composite mode because
    // the meaning of ui32Index is different in both cases.
    //
    psMSCDevice = pvMSCDevice;

    //
    // Initialize the workspace in the passed instance structure.
    //
    psInst = &psMSCDevice->sPrivateData;

    //
    // Get the endpoints status.
    //
    ui32EPStatus = USBEndpointStatus(USBA_BASE, psInst->ui8OUTEndpoint);

    //
    // Handler for the bulk IN data endpoint.
    //
    if((ui32Status & (1 << USBEPToIndex(psInst->ui8INEndpoint))))
    {
        switch(psInst->ui8SCSIState)
        {
            //
            // Handle the case where we are sending out data due to a read
            // command.
            //
            case STATE_SCSI_SEND_BLOCKS:
            {
                //
                // Decrement the number of bytes left to send.
                //
                psInst->ui32BytesToTransfer -= MAX_TRANSFER_SIZE;
                //
                //Add the bytes transfered
                //
                g_bytesRead = g_bytesRead + MAX_TRANSFER_SIZE;

                //
                // If we are done then move on to the status phase.
                //
                if(psInst->ui32BytesToTransfer == 0)
                {
                    //
                    // Set the status so that it can be sent when this
                    // response has has be successfully sent.
                    //
                    g_sSCSICSW.bCSWStatus = 0;
                    writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),0);
                    g_bytesRead = 0;

                    //
                    // Send back the status once this transfer is complete.
                    //
                    psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
                    USBDSCSISendStatus(psMSCDevice);

                    if(psMSCDevice->pfnEventCallback)
                    {
                        psMSCDevice->pfnEventCallback(0, USBD_MSC_EVENT_IDLE,
                                                      0, 0);
                    }
                    //
                    // The transfer is complete so don't read anymore data.
                    //
                    break;
                }

                if(g_bytesRead == g_pui32BlockSize)
                {
                    //
                    // Move on to the next Logical Block.
                    //
                    psInst->ui32CurrentLBA++;
                    g_bytesRead = 0;
                }

                //
                // Read the new data and send it out.
                //
                if(psMSCDevice->sMediaFunctions.pfnBlockRead(psInst->pvMedia,
                                              (uint8_t *)psInst->pui32Buffer,
                                              psInst->ui32CurrentLBA,g_bytesRead, 1) == 0)
                {
                }

                
                USBEndpointDataPut(USBA_BASE, psInst->ui8INEndpoint, psInst->pui32Buffer,
                                    MAX_TRANSFER_SIZE);
                USBEndpointDataSend(USBA_BASE, psInst->ui8INEndpoint,
                                        USB_TRANS_IN);

                break;
            }

            //
            // Handle sending status.
            //
            case STATE_SCSI_SEND_STATUS:
            {
                //
                // Indicate success and no extra data coming.
                //
                USBDSCSISendStatus(psMSCDevice);

                break;
            }

            //
            // Handle completing sending status.
            //
            case STATE_SCSI_SENT_STATUS:
            {
                psInst->ui8SCSIState = STATE_SCSI_IDLE;

                break;
            }

            //
            // These cases should not occur as the being in the IDLE state due
            // to an IN interrupt is invalid.
            //
            case STATE_SCSI_IDLE:
            default:
            {
                break;
            }
        }
    }

    //
    // Handler for the bulk OUT data endpoint.
    //
    if(ui32Status & (0x10000 << USBEPToIndex(psInst->ui8OUTEndpoint)))
    {
        //
        // Get the endpoint status to see why we were called.
        //
        ui32EPStatus = USBEndpointStatus(USBA_BASE,
                                             psInst->ui8OUTEndpoint);

        switch(psInst->ui8SCSIState)
        {
            //
            // Receiving and writing bytes to the storage device.
            //
            case STATE_SCSI_RECEIVE_BLOCKS:
            {
                ui32Size = MAX_TRANSFER_SIZE;
                USBEndpointDataGet(psInst->ui32USBBase,
                                    psInst->ui8OUTEndpoint,
                                    psInst->pui32Buffer, &ui32Size);
                //
                // Acknowledge the OUT data packet.
                //
                USBDevEndpointDataAck(psInst->ui32USBBase,
                                      psInst->ui8OUTEndpoint,false);
                //
                // Write the new data.
                //
                psMSCDevice->sMediaFunctions.pfnBlockWrite(psInst->pvMedia,
                                                (uint8_t *)psInst->pui32Buffer,
                                                psInst->ui32CurrentLBA,g_bytesWritten,1);

                //
                // Update the current status for the buffer.
                //
                psInst->ui32BytesToTransfer -= MAX_TRANSFER_SIZE;
                g_bytesWritten = g_bytesWritten + MAX_TRANSFER_SIZE;

                if(g_bytesWritten == g_pui32BlockSize)                    
                {
                    g_bytesWritten = 0;
                    psInst->ui32CurrentLBA++;

                }

                //
                // Check if all bytes have been received.
                //
                if(psInst->ui32BytesToTransfer == 0)
                {
                    //
                    // Set the status so that it can be sent when this response
                    // has be successfully sent.
                    //
                    g_sSCSICSW.bCSWStatus = 0;
                    writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),0);
                    g_bytesWritten = 0;
                    psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
                    //
                    // Indicate success and no extra data coming.
                    //
                    USBDSCSISendStatus(psMSCDevice);


                    //
                    // If there is an event callback then call it to notify
                    // that last operation has completed.
                    //
                    if(psMSCDevice->pfnEventCallback)
                    {
                        psMSCDevice->pfnEventCallback(0, USBD_MSC_EVENT_IDLE,
                                                      0, 0);
                    }
                }
                break;
            }

            //
            // If there is an OUT transfer in idle state then it was a new
            // command.
            //
            case STATE_SCSI_IDLE:
            {
                //
                // Attempt to handle the new command.
                //

                //
                // Receive the command.
                //
                ui32Size = COMMAND_BUFFER_SIZE;
                USBEndpointDataGet(psInst->ui32USBBase,
                                       psInst->ui8OUTEndpoint,
                                       g_pui8Command, &ui32Size);
                psSCSICBW = (tMSCCBW *)g_pui8Command;

                //
                // Acknowledge the OUT data packet.
                //
                USBDevEndpointDataAck(psInst->ui32USBBase,
                                          psInst->ui8OUTEndpoint, false);

                //
                // If this is a valid CBW then handle it.
                //
                if(readusb32_t(&(psSCSICBW->dCBWSignature)) == CBW_SIGNATURE)
                {
                    writeusb32_t(&(g_sSCSICSW.dCSWSignature),CSW_SIGNATURE);
                    g_sSCSICSW.dCSWTag = psSCSICBW->dCBWTag;
                    writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),0);
                    g_sSCSICSW.bCSWStatus = 0;

                    USBDSCSICommand(psMSCDevice, psSCSICBW);
                }
                else
                {
                    //
                    // Just return to the idle state since we are now out of
                    // sync with the host.  This should not happen, but this
                    // should allow the device to synchronize with the host
                    // controller.
                    //
                    psInst->ui8SCSIState = STATE_SCSI_IDLE;
                }

                break;
            }
            default:
            {
                break;
            }
        }

        //
        // Clear the status bits.
        //
        USBDevEndpointStatusClear(USBA_BASE, psInst->ui8OUTEndpoint,
                                      ui32EPStatus);
    }
}

//*****************************************************************************
//
// Device instance specific handler.
//
//*****************************************************************************
static void
HandleDevice(void *pvMSCDevice, uint32_t ui32Request, void *pvRequestData)
{
    tMSCInstance *psInst;
    uint8_t *pui8Data;
    tUSBDMSCDevice *psMSCDevice;

    psMSCDevice = (tUSBDMSCDevice *)pvMSCDevice;

    //
    // Get the instance data pointers.
    //
    psInst = &((tUSBDMSCDevice *)pvMSCDevice)->sPrivateData;

    //
    // Create the 8-bit array used by the events supported by the USB MSC
    // class.
    //
    pui8Data = (uint8_t *)pvRequestData;

    switch(ui32Request)
    {
        //
        // This was an interface change event.
        //
        case USB_EVENT_COMP_IFACE_CHANGE:
        {
            psInst->ui8Interface = pui8Data[1];
            break;
        }

        //
        // This was an endpoint change event.
        //
        case USB_EVENT_COMP_EP_CHANGE:
        {
            //
            // Determine if this is an IN or OUT endpoint that has changed.
            //
            if(pui8Data[0] & USB_EP_DESC_IN)
            {
                psInst->ui8INEndpoint = IndexToUSBEP((pui8Data[1] & 0x7f));
            }
            else
            {
                psInst->ui8OUTEndpoint = IndexToUSBEP(pui8Data[1] & 0x7f);
            }
            break;
        }
        case USB_EVENT_LPM_RESUME:
        {
            if(psMSCDevice->pfnEventCallback)
            {
                //
                // Pass the LPM resume event to the client.
                //
                psMSCDevice->pfnEventCallback(0, USB_EVENT_LPM_RESUME, 0,
                                              (void *)0);
            }
            break;
        }
        case USB_EVENT_LPM_SLEEP:
        {
            if(psMSCDevice->pfnEventCallback)
            {
                //
                // Pass the LPM sleep event to the client.
                //
                psMSCDevice->pfnEventCallback(0, USB_EVENT_LPM_RESUME, 0,
                                              (void *)0);
            }
            break;
        }
        case USB_EVENT_LPM_ERROR:
        {
            if(psMSCDevice->pfnEventCallback)
            {
                //
                // Pass the LPM error event to the client.
                //
                psMSCDevice->pfnEventCallback(0, USB_EVENT_LPM_RESUME, 0,
                                              (void *)0);
            }
            break;
        }
        default:
        {
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the device is
// disconnected from the host.
//
//*****************************************************************************
static void
HandleDisconnect(void *pvMSCDevice)
{
    tUSBDMSCDevice *psMSCDevice;

