ha1vk/TMS320F28-USBDMSC-GeekCon-2024/usblib/device/usbdmsc.c
    ASSERT(pvMSCDevice != 0);

    //
    // Create the instance pointer.
    //
    psMSCDevice = (tUSBDMSCDevice *)pvMSCDevice;

    //
    // Close the drive requested.
    //
    if(psMSCDevice->sPrivateData.pvMedia != 0)
    {
        psMSCDevice->sPrivateData.pvMedia = 0;
        psMSCDevice->sMediaFunctions.pfnClose(0);
    }

    //
    // If we have a control callback, let the client know we are open for
    // business.
    //
    if(psMSCDevice->pfnEventCallback)
    {
        //
        // Pass the connected event to the client.
        //
        psMSCDevice->pfnEventCallback(pvMSCDevice, USB_EVENT_DISCONNECTED, 0,
                                      0);
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the device
// configuration changes.
//
//*****************************************************************************
static void
ConfigChangeHandler(void *pvMSCDevice, uint32_t ui32Value)
{
    tUSBDMSCDevice *psMSCDevice;

    ASSERT(pvMSCDevice != 0);

    //
    // Create the instance pointer.
    //
    psMSCDevice = (tUSBDMSCDevice *)pvMSCDevice;
    tMSCInstance *psInst = &psMSCDevice->sPrivateData;
    USBEndpointDMADisable(USBA_BASE, psInst->ui8INEndpoint, USB_EP_DEV_IN);
    USBEndpointDMADisable(USBA_BASE, psInst->ui8OUTEndpoint, USB_EP_DEV_OUT);


    //
    // If we have a control callback, let the client know we are open for
    // business.
    //
    if(psMSCDevice->pfnEventCallback)
    {
        //
        // Pass the connected event to the client.
        //
        psMSCDevice->pfnEventCallback(pvMSCDevice, USB_EVENT_CONNECTED, 0, 0);
    }
}

//*****************************************************************************
//
//! This function should be called once for the mass storage class device to
//! initialized basic operation and prepare for enumeration.
//!
//! \param ui32Index is the index of the USB controller to initialize for
//! mass storage class device operation.
//! \param psMSCDevice points to a structure containing parameters customizing
//! the operation of the mass storage device.
//!
//! In order for an application to initialize the USB device mass storage
//! class, it must first call this function with the a valid mass storage
//! device class structure in the \e psMSCDevice parameter.  This allows this
//! function to initialize the USB controller and device code to be prepared to
//! enumerate and function as a USB mass storage device.
//!
//! This function returns a void pointer that must be passed in to all other
//! APIs used by the mass storage class.
//!
//! See the documentation on the tUSBDMSCDevice structure for more information
//! on how to properly fill the structure members.
//!
//! \return Returns 0 on failure or a non-zero void pointer on success.
//
//*****************************************************************************
void *
USBDMSCInit(uint32_t ui32Index, tUSBDMSCDevice *psMSCDevice)
{
    tDeviceDescriptor *psDevDesc;
    tConfigDescriptor *pConfDesc;

    //
    // Check parameter validity.
    //
    ASSERT(ui32Index == 0);
    ASSERT(psMSCDevice);
    ASSERT(psMSCDevice->ppui8StringDescriptors);

    USBDMSCCompositeInit(ui32Index, psMSCDevice, 0);

    //
    // Fix up the device descriptor with the client-supplied values.
    //
    psDevDesc = (tDeviceDescriptor *)g_pui8MSCDeviceDescriptor;
    writeusb16_t(&(psDevDesc->idVendor),psMSCDevice->ui16VID);
    writeusb16_t(&(psDevDesc->idProduct),psMSCDevice->ui16PID);

    //
    // Fix up the configuration descriptor with client-supplied values.
    //
    pConfDesc = (tConfigDescriptor *)g_pui8MSCDescriptor;
    pConfDesc->bmAttributes = psMSCDevice->ui8PwrAttributes;
    pConfDesc->bMaxPower = (uint8_t)(psMSCDevice->ui16MaxPowermA / 2);

    //
    // All is well so now pass the descriptors to the lower layer and put
    // the bulk device on the bus.
    //
    USBDCDInit(ui32Index, &psMSCDevice->sPrivateData.sDevInfo,
               (void *)psMSCDevice);

    //
    // Return the pointer to the instance indicating that everything went well.
    //
    return((void *)psMSCDevice);
}

//*****************************************************************************
//
//! This function should be called once for the mass storage class device to
//! initialized basic operation and prepare for enumeration.
//!
//! \param ui32Index is the index of the USB controller to initialize for
//! mass storage class device operation.
//! \param psMSCDevice points to a structure containing parameters customizing
//! the operation of the mass storage device.
//! \param psCompEntry is the composite device entry to initialize when
//! creating a composite device.
//!
//! In order for an application to initialize the USB device mass storage
//! class, it must first call this function with the a valid mass storage
//! device class structure in the \e psMSCDevice parameter.  This allows this
//! function to initialize the USB controller and device code to be prepared to
//! enumerate and function as a USB mass storage device.  If this mass storage
//! device is part of a composite device, then the \e psCompEntry should
//! point to the composite device entry to initialize.  This is part of the
//! array that is passed to the USBDCompositeInit() function.
//!
//! This function returns a void pointer that must be passed in to all other
//! APIs used by the mass storage class.
//!
//! See the documentation on the tUSBDMSCDevice structure for more information
//! on how to properly fill the structure members.
//!
//! \return Returns zero on failure or a non-zero instance value that should be
//! used with the remaining USB mass storage APIs.
//
//*****************************************************************************
void *
USBDMSCCompositeInit(uint32_t ui32Index, tUSBDMSCDevice *psMSCDevice,
                     tCompositeEntry *psCompEntry)
{
    tMSCInstance *psInst;

    //
    // Check parameter validity.
    //
    ASSERT(ui32Index == 0);
    ASSERT(psMSCDevice);
    ASSERT(psMSCDevice->ppui8StringDescriptors);
    ASSERT(psCompEntry != 0);

    //
    // Initialize the workspace in the passed instance structure.
    //
    psInst = &psMSCDevice->sPrivateData;
    psInst->ui32USBBase = USBA_BASE;
    psInst->bConnected = false;
    psInst->iMediaStatus = eUSBDMSCMediaUnknown;

    //
    // Initialize the composite entry that is used by the composite device
    // class.
    //
    if(psCompEntry != 0)
    {
        psCompEntry->psDevInfo = &psInst->sDevInfo;
        psCompEntry->pvInstance = (void *)psMSCDevice;
    }

    //
    // Initialize the device information structure.
    //
    psInst->sDevInfo.psCallbacks = &g_sMSCHandlers;
    psInst->sDevInfo.pui8DeviceDescriptor = g_pui8MSCDeviceDescriptor;
    psInst->sDevInfo.ppsConfigDescriptors = g_ppsMSCConfigDescriptors;
    psInst->sDevInfo.ppui8StringDescriptors = 0;
    psInst->sDevInfo.ui32NumStringDescriptors = 0;

    //
    // Initialize the device info structure for the mass storage device.
    //
    USBDCDDeviceInfoInit(0, &psInst->sDevInfo);

    //
    // Set the initial interface and endpoints.
    //
    psInst->ui8Interface = 0;
    psInst->ui8OUTEndpoint = DATA_OUT_ENDPOINT;
    psInst->ui8INEndpoint = DATA_IN_ENDPOINT;

    //
    // Set the initial SCSI state to idle.
    //
    psInst->ui8SCSIState = STATE_SCSI_IDLE;

    //
    // Plug in the client's string stable to the device information
    // structure.
    //
    psInst->sDevInfo.ppui8StringDescriptors =
                                        psMSCDevice->ppui8StringDescriptors;
    psInst->sDevInfo.ui32NumStringDescriptors =
                                        psMSCDevice->ui32NumStringDescriptors;

    //
    // Open the drive requested.
    //
    psInst->pvMedia = psMSCDevice->sMediaFunctions.pfnOpen(0);

