ha1vk/TMS320F28-USBDMSC-GeekCon-2024/usblib/device/usbdmsc.c
    if(psInst->pvMedia == 0)
    {
        //
        // There is no media currently present.
        //
        psInst->ui8SenseKey = SCSI_RS_KEY_NOT_READY;
        psInst->ui16AddSenseCode = SCSI_RS_MED_NOT_PRSNT;
    }
    else
    {
        //
        // Media is now ready for use.
        //
        psInst->ui8SenseKey = SCSI_RS_KEY_UNIT_ATTN;
        psInst->ui16AddSenseCode = SCSI_RS_MED_NOTRDY2RDY;
    }

    //
    // Enable Clocking to the USB controller.
    //
    SysCtl_enablePeripheral(SYSCTL_PERIPH_CLK_USBA);

    //
    // Turn on USB Phy clock.
    //
    //SysCtlUSBPLLEnable();
    //
    // Return the pointer to the instance indicating that everything went well.
    //
    return((void *)psMSCDevice);
}

//*****************************************************************************
//
//! Shuts down the mass storage device.
//!
//! \param pvMSCDevice is the pointer to the device instance structure as
//! returned by USBDMSCInit() or USBDMSCCompositeInit().
//!
//! This function terminates mass storage operation for the instance supplied
//! and removes the device from the USB bus.  Following this call, the
//! \e pvMSCDevice instance may not me used in any other call to the mass
//! storage device other than USBDMSCInit() or USBDMSCCompositeInit().
//!
//! \return None.
//
//*****************************************************************************
void
USBDMSCTerm(void *pvMSCDevice)
{
    tUSBDMSCDevice *psMSCDevice;

    ASSERT(pvMSCDevice != 0);

    //
    // Cleanly exit device mode.
    //
    USBDCDTerm(0);

    //
    // Create a device instance pointer.
    //
    psMSCDevice = pvMSCDevice;

    //
    // If the media was opened the close it out.
    //
    if(psMSCDevice->sPrivateData.pvMedia != 0)
    {
        psMSCDevice->sPrivateData.pvMedia = 0;
        psMSCDevice->sMediaFunctions.pfnClose(0);
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever a non-standard
// request is received.
//
// \param pvMSCDevice is instance data for this request.
// \param pUSBRequest points to the request received.
//
// This call parses the provided request structure to determine the command.
// The only mass storage command supported over endpoint 0 is the Get Max LUN
// command.
//
// \return None.
//
//*****************************************************************************
static void
HandleRequests(void *pvMSCDevice, tUSBRequest *pUSBRequest)
{
    //
    // This class only support a single LUN.
    //
    static const uint8_t ui8MaxLun = 0;

    ASSERT(pvMSCDevice != 0);

    //
    // Determine the type of request.
    //
    switch(pUSBRequest->bRequest)
    {
        //
        // A Set Report request is received from the host when it sends an
        // Output report via endpoint 0.
        //
        case USBREQ_GET_MAX_LUN:
        {
            //
            // Need to ACK the data on end point 0 with last data since there
            // is no more data expected.
            //
            USBDevEndpointDataAck(USBA_BASE, USB_EP_0, true);

            //
            // Send our response to the host.
            //
            USBDCDSendDataEP0(0, (uint8_t *)&ui8MaxLun, 1);

            break;
        }
        case USBREQ_BULK_ONLY_RESET:
        {
            //
            // Need to ACK the data on end point 0 with last data since there
            // is no more data expected.
            //
            USBDevEndpointDataAck(USBA_BASE, USB_EP_0, true);

            //
            // Send a null packet to the host.
            //
            USBDCDSendDataEP0(0, (uint8_t *)&ui8MaxLun, 0);

            break;
        }

        //
        // This request was not recognized so stall.
        //
        default:
        {
            USBDCDStallEP0(0);
            break;
        }
    }
}

//*****************************************************************************
//
// This function is used to handle the SCSI Inquiry command when it is received
// from the host.
//
//*****************************************************************************
static void
USBDSCSIInquiry(tUSBDMSCDevice *psMSCDevice)
{
    int32_t i32Idx;
    tMSCInstance *psInst;
    uint32_t *pui32Data;

    //
    // Create a local 32-bit pointer to the command.
    //
    pui32Data = (uint32_t *)g_pui8Command;

    //
    // Create the serial instance data.
    //
    psInst = &psMSCDevice->sPrivateData;

    //
    // Direct Access device, Removable storage and SCSI 1 responses.
    //
    pui32Data[0] = SCSI_INQ_PDT_SBC | (SCSI_INQ_RMB << 8);

    //
    // Additional Length is fixed at 31 bytes.
    //
    pui32Data[1] = 31;

    //
    // Copy the Vendor string.
    //
    for(i32Idx = 0; i32Idx < 8; i32Idx++)
    {
        g_pui8Command[i32Idx + 8] = psMSCDevice->pui8Vendor[i32Idx];
    }

    //
    // Copy the Product string.
    //
    for(i32Idx = 0; i32Idx < 16; i32Idx++)
    {
        g_pui8Command[i32Idx + 16] = psMSCDevice->pui8Product[i32Idx];
    }

    //
    // Copy the Version string.
    //
    for(i32Idx = 0; i32Idx < 4; i32Idx++)
    {
        g_pui8Command[i32Idx + 32] = psMSCDevice->pui8Version[i32Idx];
    }

    //
    // Send the SCSI Inquiry Response.
    //
    USBEndpointDataPut(USBA_BASE, psInst->ui8INEndpoint, g_pui8Command,
                           36);

    //
    // Send the data to the host.
    //
    USBEndpointDataSend(USBA_BASE, psInst->ui8INEndpoint, USB_TRANS_IN);

    //
    // Set the status so that it can be sent when this response has
    // has be successfully sent.
    //
    g_sSCSICSW.bCSWStatus = 0;
    writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),0);

    psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
}

//*****************************************************************************
//
// This function is used to handle the SCSI Read Capacities command when it is
// received from the host.
//
//*****************************************************************************
static void
USBDSCSIReadCapacities(tUSBDMSCDevice *psMSCDevice)
{
    uint32_t ui32Blocks;
    tMSCInstance *psInst;
    uint32_t *pui32Data;

    //
    // Create a local 32-bit pointer to the command.
    //
    pui32Data = (uint32_t *)g_pui8Command;

    //
    // Get our instance data pointer.
    //
    psInst = &psMSCDevice->sPrivateData;

    if(psInst->pvMedia != 0)
    {
        if(psMSCDevice->sMediaFunctions.pfnBlockSize)
        {
            //
            // Query the block size for the device
            //
            g_pui32BlockSize =
                     psMSCDevice->sMediaFunctions.pfnBlockSize(psInst->pvMedia);
        }
        ui32Blocks =
                    psMSCDevice->sMediaFunctions.pfnNumBlocks(psInst->pvMedia);

        pui32Data[0] = 0x08000000;

        //
        // Fill in the number of blocks, the bytes endianness must be changed.
        //
        g_pui8Command[4] = ui32Blocks >> 24;
        g_pui8Command[5] = 0xff & (ui32Blocks >> 16);
        g_pui8Command[6] = 0xff & (ui32Blocks >> 8);
        g_pui8Command[7] = 0xff & (ui32Blocks);

        //
        // Current media capacity
        //
        g_pui8Command[8] = 0x2;

        //
        // Fill in the block size, which is g_pui32BlockSize.
        //
        g_pui8Command[9] = 0xff & (g_pui32BlockSize >> 16);
        g_pui8Command[10] = 0xff & (g_pui32BlockSize >> 8);
        g_pui8Command[11] = 0xff & g_pui32BlockSize;

        //
        // Send out the 12 bytes that are in this response.
        //
        USBEndpointDataPut(USBA_BASE, psInst->ui8INEndpoint, g_pui8Command,
                               12);
        USBEndpointDataSend(USBA_BASE, psInst->ui8INEndpoint,
                                USB_TRANS_IN);

        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 0;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),0);
    }
    else
    {
        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 1;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),0);

        //
        // Stall the IN endpoint
        //
        USBDevEndpointStall(USBA_BASE, psInst->ui8INEndpoint,
                                USB_EP_DEV_IN);

        //
        // Mark the sense code as valid and indicate that these is no media
        // present.
        //
        psInst->ui8ErrorCode = SCSI_RS_VALID | SCSI_RS_CUR_ERRORS;
        psInst->ui8SenseKey = SCSI_RS_KEY_NOT_READY;
        psInst->ui16AddSenseCode = SCSI_RS_MED_NOT_PRSNT;
    }

    psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
}

//*****************************************************************************
//
// This function is used to handle the SCSI Read Capacity command when it is
// received from the host.
//
//*****************************************************************************
static void
USBDSCSIReadCapacity(tUSBDMSCDevice *psMSCDevice)
{
    uint32_t ui32Blocks;
    tMSCInstance *psInst;

    //
    // Get our instance data pointer.
    //
    psInst = &psMSCDevice->sPrivateData;

    if(psMSCDevice->sMediaFunctions.pfnBlockSize)
    {
        //
        // Query the block size for the device
        //
        g_pui32BlockSize =
                 psMSCDevice->sMediaFunctions.pfnBlockSize(psInst->pvMedia);
    }

    ui32Blocks = psMSCDevice->sMediaFunctions.pfnNumBlocks(psInst->pvMedia);

    //
    // Only decrement if any blocks were found.
    //
    if(ui32Blocks != 0)
    {
        //
        // One less than the maximum number is the last addressable
        // block.
        //
        ui32Blocks--;
    }

    if(psInst->pvMedia != 0)
    {
        //
        // Fill in the number of blocks, the bytes endianness must be changed.
        //
        g_pui8Command[0] = 0xff & (ui32Blocks >> 24);
        g_pui8Command[1] = 0xff & (ui32Blocks >> 16);
        g_pui8Command[2] = 0xff & (ui32Blocks >> 8);
        g_pui8Command[3] = 0xff & (ui32Blocks);

        g_pui8Command[4] = 0;

        //
        // Fill in the block size, which is g_pui32BlockSize.
        //
        g_pui8Command[5] = 0xff & (g_pui32BlockSize >> 16);
        g_pui8Command[6] = 0xff & (g_pui32BlockSize >> 8);
        g_pui8Command[7] = 0xff & g_pui32BlockSize;

        //
        // Send the SCSI Inquiry Response.
        //
        USBEndpointDataPut(USBA_BASE, psInst->ui8INEndpoint, g_pui8Command,
                               8);
        USBEndpointDataSend(USBA_BASE, psInst->ui8INEndpoint,
                                USB_TRANS_IN);

        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 0;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),0);
    }
    else
    {
        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 1;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),0);

        //
        // Stall the IN endpoint
        //
        USBDevEndpointStall(USBA_BASE, psInst->ui8INEndpoint,
                                USB_EP_DEV_IN);

        //
        // Mark the sense code as valid and indicate that these is no media
        // present.
        //
        psInst->ui8ErrorCode = SCSI_RS_VALID | SCSI_RS_CUR_ERRORS;
        psInst->ui8SenseKey = SCSI_RS_KEY_NOT_READY;
        psInst->ui16AddSenseCode = SCSI_RS_MED_NOT_PRSNT;
    }

    psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
}

//*****************************************************************************
//
// This function is used to handle the SCSI Request Sense command when it is
// received from the host.
//
//*****************************************************************************
static void
USBDSCSIRequestSense(tUSBDMSCDevice *psMSCDevice)
{
    tMSCInstance *psInst;
    int32_t i32Idx;

    //
    // Zero out the response data.
    //
    for(i32Idx = 0; i32Idx < 18; i32Idx++)
    {
        g_pui8Command[i32Idx] = 0;
    }

    //
    // Get our instance data pointer.
    //
    psInst = &psMSCDevice->sPrivateData;

    //
    // The request sense response.
    //
    g_pui8Command[0] = psInst->ui8ErrorCode;
    g_pui8Command[2] = psInst->ui8SenseKey;

    //
    // There are 10 more bytes of data.
    //
    g_pui8Command[7] = 10;

    //
    // Transition from not ready to ready.
    //
    g_pui8Command[12] = (uint8_t)psInst->ui16AddSenseCode;
    g_pui8Command[13] = (uint8_t)(psInst->ui16AddSenseCode >> 8);

    //
    // Send the SCSI Inquiry Response.
    //
    USBEndpointDataPut(USBA_BASE, psInst->ui8INEndpoint, g_pui8Command,
                           18);
    USBEndpointDataSend(USBA_BASE, psInst->ui8INEndpoint, USB_TRANS_IN);

    //
    // Reset the valid flag on errors.
    //
    psInst->ui8ErrorCode = SCSI_RS_CUR_ERRORS;

    //
    // Set the status so that it can be sent when this response has
    // has be successfully sent.
    //
    g_sSCSICSW.bCSWStatus = 0;
    writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),0);

    //
    // Move on to the status phase.
    //
    psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
}

//*****************************************************************************
//
// This function is used to handle the SCSI Read 10 command when it is
// received from the host.
//
//*****************************************************************************
static void
USBDSCSIRead10(tUSBDMSCDevice *psMSCDevice, tMSCCBW *psSCSICBW)
{
    uint16_t ui16NumBlocks;
    tMSCInstance *psInst;

    //
    // Default the number of blocks.
    //
    ui16NumBlocks = 0;

    //
    // Get our instance data pointer.
    //
    psInst = &psMSCDevice->sPrivateData;

    if(psInst->pvMedia != 0)
    {
        //
        // Get the logical block from the CBW structure. This switching
        // is required to convert from big to little endian.
        //
        psInst->ui32CurrentLBA = (((uint32_t)psSCSICBW->CBWCB[2]) << 24) |
                                 (((uint32_t)psSCSICBW->CBWCB[3]) << 16) |
                                 (((uint32_t)psSCSICBW->CBWCB[4]) << 8) |
                                 (psSCSICBW->CBWCB[5] << 0);

        //
        // More bytes to read.
        //
        ui16NumBlocks = (psSCSICBW->CBWCB[7] << 8) | psSCSICBW->CBWCB[8];
        g_bytesRead = 0;

        //
        // Read the next logical block from the storage device.
        //
        if(psMSCDevice->sMediaFunctions.pfnBlockRead(psInst->pvMedia,
               (uint8_t *)psInst->pui32Buffer, psInst->ui32CurrentLBA,g_bytesRead,1) == 0)
        {
            psInst->pvMedia = 0;
            psMSCDevice->sMediaFunctions.pfnClose(0);
        }
    }

    //
    // If there is media present then start transferring the data.
    //
    if(psInst->pvMedia != 0)
    {
        //
        // Schedule the remaining bytes to send.
        //
        psInst->ui32BytesToTransfer = (g_pui32BlockSize * ui16NumBlocks);

        //
        // Send the Data
        //
        USBEndpointDataPut(USBA_BASE, psInst->ui8INEndpoint, psInst->pui32Buffer,
                                    MAX_TRANSFER_SIZE);
        USBEndpointDataSend(USBA_BASE, psInst->ui8INEndpoint,
                                        USB_TRANS_IN);
        //
        // Move on and start sending blocks.
        //
        psInst->ui8SCSIState = STATE_SCSI_SEND_BLOCKS;
        //psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;

