ha1vk/TMS320F28-USBDMSC-GeekCon-2024/usblib/device/usbdmsc.c
        if(psMSCDevice->pfnEventCallback)
        {
            psMSCDevice->pfnEventCallback(0, USBD_MSC_EVENT_READING, 0, 0);
        }
    }
    else
    {
        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 1;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue) , 0);

        //
        // Stall the IN endpoint
        //
        USBDevEndpointStall(USBA_BASE, psInst->ui8INEndpoint,
                                USB_EP_DEV_IN);

        //
        // Mark the sense code as valid and indicate that these is no media
        // present.
        //
        psInst->ui8ErrorCode = SCSI_RS_VALID | SCSI_RS_CUR_ERRORS;
        psInst->ui8SenseKey = SCSI_RS_KEY_NOT_READY;
        psInst->ui16AddSenseCode = SCSI_RS_MED_NOT_PRSNT;

        psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
    }
}

//*****************************************************************************
//
// This function is used to handle the SCSI Read 10 command when it is
// received from the host.
//
//*****************************************************************************
static void
USBDSCSIWrite10(tUSBDMSCDevice *psMSCDevice, tMSCCBW *psSCSICBW)
{
    uint16_t ui16NumBlocks;
    tMSCInstance *psInst;

    //
    // Get instance data pointers.
    //
    psInst = &psMSCDevice->sPrivateData;

    //
    // If there is media present then start transferring the data.
    //
    if(psInst->pvMedia != 0)
    {
        //
        // Get the logical block from the CBW structure. This switching
        // is required to convert from big to little endian.
        //
        psInst->ui32CurrentLBA = (((uint32_t)psSCSICBW->CBWCB[2]) << 24) |
                                 (((uint32_t)psSCSICBW->CBWCB[3]) << 16) |
                                 (((uint32_t)psSCSICBW->CBWCB[4]) << 8) |
                                 (((uint32_t)psSCSICBW->CBWCB[5]) << 0);

        //
        // More bytes to read.
        //
        ui16NumBlocks = (psSCSICBW->CBWCB[7] << 8) | psSCSICBW->CBWCB[8];

        psInst->ui32BytesToTransfer = g_pui32BlockSize * ui16NumBlocks;

        //
        // Start sending logical blocks, these are always multiples of
        // g_pui32BlockSize bytes.
        //
        psInst->ui8SCSIState = STATE_SCSI_RECEIVE_BLOCKS;
        g_bytesWritten = 0;
        
        //
        // Notify the application of the write event.
        //
        if(psMSCDevice->pfnEventCallback)
        {
            psMSCDevice->pfnEventCallback(0, USBD_MSC_EVENT_WRITING, 0, 0);
        }
    }
    else
    {
        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 1;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue) , 0);

        //
        // Stall the IN endpoint
        //
        USBDevEndpointStall(USBA_BASE, psInst->ui8OUTEndpoint,
                                USB_EP_DEV_OUT);

        //
        // Mark the sense code as valid and indicate that these is no media
        // present.
        //
        psInst->ui8ErrorCode = SCSI_RS_VALID | SCSI_RS_CUR_ERRORS;
        psInst->ui8SenseKey = SCSI_RS_KEY_NOT_READY;
        psInst->ui16AddSenseCode = SCSI_RS_MED_NOT_PRSNT;

        psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
    }
}

//*****************************************************************************
//
// This function is used to handle the SCSI Mode Sense 6 command when it is
// received from the host.
//
//*****************************************************************************
static void
USBDSCSIModeSense6(tUSBDMSCDevice *psMSCDevice, tMSCCBW *psSCSICBW)
{
    tMSCInstance *psInst;

    //
    // Get our instance data pointer.
    //
    psInst = &psMSCDevice->sPrivateData;

    //
    // If there is media present send the response.
    //
    if(psInst->pvMedia != 0)
    {
        //
        // Three extra bytes in this response.
        //
        g_pui8Command[0] = 3;
        g_pui8Command[1] = 0;
        g_pui8Command[2] = 0;
        g_pui8Command[3] = 0;

        //
        // Manually send the response back to the host.
        //
        USBEndpointDataPut(USBA_BASE, psInst->ui8INEndpoint, g_pui8Command,
                               4);
        USBEndpointDataSend(USBA_BASE, psInst->ui8INEndpoint,
                                USB_TRANS_IN);

        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 0;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue),readusb32_t(&(psSCSICBW->dCBWDataTransferLength)) - 4);
    }
    else
    {
        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 1;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue) ,0);

        //
        // Stall the IN endpoint
        //
        USBDevEndpointStall(USBA_BASE, psInst->ui8INEndpoint,
                                USB_EP_DEV_IN);

        //
        // Mark the sense code as valid and indicate that these is no media
        // present.
        //
        psInst->ui8ErrorCode = SCSI_RS_VALID | SCSI_RS_CUR_ERRORS;
        psInst->ui8SenseKey = SCSI_RS_KEY_NOT_READY;
        psInst->ui16AddSenseCode = SCSI_RS_MED_NOT_PRSNT;
    }

    psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
}

//*****************************************************************************
//
// This function is used to send out the response data based on the current
// status of the mass storage class.
//
//*****************************************************************************
static void
USBDSCSISendStatus(tUSBDMSCDevice *psMSCDevice)
{
    tMSCInstance *psInst;

    //
    // Get our instance data pointer.
    //
    psInst = &psMSCDevice->sPrivateData;

    //
    // Respond with the requested status.
    //
    USBEndpointDataPut(USBA_BASE, psInst->ui8INEndpoint,
                           (uint8_t *)&g_sSCSICSW, 13);
    USBEndpointDataSend(USBA_BASE, psInst->ui8INEndpoint, USB_TRANS_IN);

    //
    // Move the state to status sent so that the next interrupt will move the
    // statue to idle.
    //
    psInst->ui8SCSIState = STATE_SCSI_SENT_STATUS;
}

//*****************************************************************************
//
// This function is used to handle the Prevent/Allow Medium Removal command when it is
// received from the host.
//
//*****************************************************************************
static void
USBDSCSIPreventAllowMediumRemoval(tUSBDMSCDevice *psMSCDevice, tMSCCBW *psSCSICBW)
{
    tMSCInstance *psInst;

    //
    // Get our instance data pointer.
    //
    psInst = &psMSCDevice->sPrivateData;

    //
    // If there is media present send the response.
    //
    if(psInst->pvMedia != 0)
    {
        //
        // See if this was an allow or prevent removal request.
        //
        if((psSCSICBW->CBWCB[4] & SCSI_PE_MEDRMV_M) == SCSI_PE_MEDRMV_ALLOW)
        {
            psInst->ui32Flags |= USBD_FLAG_ALLOW_REMOVAL;
        }
        else
        {
            psInst->ui32Flags &= ~USBD_FLAG_ALLOW_REMOVAL;
        }

        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 0;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue), 0);
    }
    else
    {
        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 1;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue) , 0);

        //
        // Stall the IN endpoint
        //
        USBDevEndpointStall(USBA_BASE, psInst->ui8INEndpoint,
                                USB_EP_DEV_IN);

        //
        // Mark the sense code as valid and indicate that these is no media
        // present.
        //
        psInst->ui8ErrorCode = SCSI_RS_VALID | SCSI_RS_CUR_ERRORS;
        psInst->ui8SenseKey = SCSI_RS_KEY_NOT_READY;
        psInst->ui16AddSenseCode = SCSI_RS_MED_NOT_PRSNT;
    }

    psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
}

//*****************************************************************************
//
// This function is used to handle the SCSI Start/Stop Unit command when it is
// received from the host.
//
//*****************************************************************************
static void
USBDSCSIStartStopUnit(tUSBDMSCDevice *psMSCDevice, tMSCCBW *psSCSICBW)
{
    tMSCInstance *psInst;

    //
    // Get our instance data pointer.
    //
    psInst = &psMSCDevice->sPrivateData;

    //
    // If there is media present send the response.
    //
    if(psInst->pvMedia != 0)
    {
        switch(psSCSICBW->CBWCB[4] & (SCSI_SS_UNIT_START | SCSI_SS_UNIT_LOEJ))
        {
            case 0:
            {
                //
                // Media state is now stopped but not ejected.
                //
                psInst->iMediaStatus = eUSBDMSCMediaStopped;

                g_sSCSICSW.bCSWStatus = 0;

                break;
            }
            case SCSI_SS_UNIT_START:
            {
                //
                // Return to Media present.
                //
                psInst->iMediaStatus = eUSBDMSCMediaPresent;

                g_sSCSICSW.bCSWStatus = 0;

                break;
            }
            case SCSI_SS_UNIT_LOEJ:
            {
                //
                // Only allow eject if the Prevent/Allow Medium Removal has
                // been sent and enabled medium removal.
                //
                if(psInst->ui32Flags & USBD_FLAG_ALLOW_REMOVAL)
                {
                    psInst->iMediaStatus = eUSBDMSCMediaNotPresent;
                    psMSCDevice->sMediaFunctions.pfnClose(0);
                    psMSCDevice->sPrivateData.pvMedia = 0;
                    g_sSCSICSW.bCSWStatus = 0;
                }
                else
                {
                    g_sSCSICSW.bCSWStatus = 1;
                }

                break;
            }
            case SCSI_SS_UNIT_START | SCSI_SS_UNIT_LOEJ:
            {
                //
                // Since there was no media, check for media here.
                //
                psInst->pvMedia = psMSCDevice->sMediaFunctions.pfnOpen(0);

                //
                // If it is still not present then fail this command.
                //
                if(psInst->pvMedia != 0)
                {
                    g_sSCSICSW.bCSWStatus = 0;
                }
                else
                {
                    g_sSCSICSW.bCSWStatus = 1;
                }
                break;
            }
            default:
            {
                break;
            }
        }

        //
        // There is no further data to send.
        //
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue) ,0);
    }
    else
    {
        //
        // Set the status so that it can be sent when this response has
        // has be successfully sent.
        //
        g_sSCSICSW.bCSWStatus = 1;
        writeusb32_t(&(g_sSCSICSW.dCSWDataResidue) , 0);

        //
        // Stall the IN endpoint
        //
        USBDevEndpointStall(USBA_BASE, psInst->ui8INEndpoint,
                                USB_EP_DEV_IN);

        //
        // Mark the sense code as valid and indicate that these is no media
        // present.
        //
        psInst->ui8ErrorCode = SCSI_RS_VALID | SCSI_RS_CUR_ERRORS;
        psInst->ui8SenseKey = SCSI_RS_KEY_NOT_READY;
        psInst->ui16AddSenseCode = SCSI_RS_MED_NOT_PRSNT;
    }

    psInst->ui8SCSIState = STATE_SCSI_SEND_STATUS;
}

//*****************************************************************************
//
// This function is used to handle all SCSI commands.
//
//*****************************************************************************
uint32_t
USBDSCSICommand(tUSBDMSCDevice *psMSCDevice, tMSCCBW *psSCSICBW)
{
    uint32_t ui32RetCode, ui32TransferLength;
    tMSCInstance *psInst;

    //
    // Get our instance data pointer.
    //
    psInst = &psMSCDevice->sPrivateData;

    //
    // Initialize the return code.
    //
    ui32RetCode = 1;

    //
    // Save the transfer length because it may be overwritten by some calls.
    //
    ui32TransferLength = readusb32_t(&(psSCSICBW->dCBWDataTransferLength));

    switch(psSCSICBW->CBWCB[0])
    {
        //
        // Respond to the SCSI Inquiry command.
        //
        case SCSI_INQUIRY_CMD:
        {
            USBDSCSIInquiry(psMSCDevice);

            break;
        }

        //
        // Respond to the test unit ready command.
        //
        case SCSI_TEST_UNIT_READY:
        {
            writeusb32_t(&( g_sSCSICSW.dCSWDataResidue) , 0);

            if(psInst->pvMedia != 0)
            {
                //
                // Set the status to success for now, this could be different
                // if there is no media present.
                //
                g_sSCSICSW.bCSWStatus = 0;
            }
            else if(psInst->iMediaStatus == eUSBDMSCMediaNotPresent)
            {
                //
                // Set the status to success for now, this could be different
                // if there is no media present.
                //
                g_sSCSICSW.bCSWStatus = 1;
                psInst->ui8ErrorCode = SCSI_RS_VALID | SCSI_RS_CUR_ERRORS;
                psInst->ui8SenseKey = SCSI_RS_KEY_NOT_READY;
                psInst->ui16AddSenseCode = SCSI_RS_MED_NOT_PRSNT;
            }
            else
            {
                //
                // Since there was no media, check for media here.
                //
                psInst->pvMedia = psMSCDevice->sMediaFunctions.pfnOpen(0);

                //
                // If it is still not present then fail this command.
                //
                if(psInst->pvMedia != 0)
                {
                    g_sSCSICSW.bCSWStatus = 0;
                }
                else
                {
                    g_sSCSICSW.bCSWStatus = 1;
                }
            }
            break;
        }

        //
        // Handle the Read Capacities command.
        //
        case SCSI_READ_CAPACITIES:
        {
            USBDSCSIReadCapacities(psMSCDevice);

            break;
        }

        //
        // Handle the Read Capacity command.
        //
        case SCSI_READ_CAPACITY:
        {
            USBDSCSIReadCapacity(psMSCDevice);

            break;
        }

        //
        // Handle the Request Sense command.
        //
        case SCSI_REQUEST_SENSE:
        {
            USBDSCSIRequestSense(psMSCDevice);

            break;
        }

        //
        // Handle the Read 10 command.
        //
        case SCSI_READ_10:
        {
            USBDSCSIRead10(psMSCDevice, psSCSICBW);
            break;
        }

        //
        // Handle the Write 10 command.
        //
        case SCSI_WRITE_10:
        {
            USBDSCSIWrite10(psMSCDevice, psSCSICBW);
            break;
        }

        //
        // Handle the Mode Sense 6 command.
        //
        case SCSI_MODE_SENSE_6:
        {
            USBDSCSIModeSense6(psMSCDevice, psSCSICBW);

            break;
        }

        //
        // Handle the Prevent/Allow Medium Removal command.
        //
        case SCSI_MEDIUM_REMOVAL:
        {
            USBDSCSIPreventAllowMediumRemoval(psMSCDevice, psSCSICBW);

            break;
        }

        //
        // Handle the Prevent/Allow Medium Removal command.
        //
        case SCSI_START_STOP_UNIT:
        {
            USBDSCSIStartStopUnit(psMSCDevice, psSCSICBW);
            break;
        }

        default:
        {
            //
            // Set the status so that it can be sent when this response has
            // has be successfully sent.
            //
            g_sSCSICSW.bCSWStatus = 1;
            g_sSCSICSW.dCSWDataResidue = psSCSICBW->dCBWDataTransferLength;

            //
            // If there is data then there is more work to do.
            //
            if(readusb32_t(&(psSCSICBW->dCBWDataTransferLength)) != 0)
            {
                if(psSCSICBW->bmCBWFlags & CBWFLAGS_DIR_IN)
                {
                    //
                    // Stall the IN endpoint
                    //
                    USBDevEndpointStall(USBA_BASE, psInst->ui8INEndpoint,
                                            USB_EP_DEV_IN);
                }
                else
                {
                    //
                    // Stall the OUT endpoint
                    //
                    USBDevEndpointStall(USBA_BASE, psInst->ui8OUTEndpoint,
                                            USB_EP_DEV_OUT);

                }

                //
                // Go back to the idle state and wait for the host to clear
                // the stall later.
                //
                psInst->ui8SCSIState = STATE_SCSI_IDLE;
            }

            //
            // Set the sense codes.
            //
            psInst->ui8ErrorCode = SCSI_RS_VALID | SCSI_RS_CUR_ERRORS;
            psInst->ui8SenseKey = SCSI_RS_KEY_ILGL_RQST;
            psInst->ui16AddSenseCode = SCSI_RS_PV_INVALID;

            break;
        }
    }

    //
    // If there is no data then send out the current status.
    //
    if(ui32TransferLength == 0)
    {
        USBDSCSISendStatus(psMSCDevice);
    }
    return(ui32RetCode);
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
